Revit 2024 API
BuiltInFailures.HvacFailures.PanelDoesntMatchCircuitPropertiesDisconnected Property
 The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PanelDoesntMatchCircuitPropertiesDisconnected { get; }
Visual Basic
Public Shared ReadOnly Property PanelDoesntMatchCircuitPropertiesDisconnected As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PanelDoesntMatchCircuitPropertiesDisconnected {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.HvacFailures Class
Autodesk.Revit.DB Namespace